8evgeny/GIT/5_Amplifier_UM_300/UM_2_MILANDR/uart_rtos/SPL/MDR32F2C10/src/MDR32F2C10_eth.c
	/* Read the buffer mode */
	BufferMode = (MDR_ETH0->G_CFG & ETH_G_CFG_BUFF_MODE_Msk);
	
    /* Send packet */
	Xtail = MDR_ETH0->X_TAIL;
    
	switch( BufferMode )
    {
		case ETH_BUFFER_MODE_LINEAR:
			/* Set pointer to output buffer */
			ptr_OutputFrame = (uint32_t *)(ETH_BUFF_BASE_ADDR + Xtail);

			/* Send frame */
			EthTransmitterFreeBufferSize = ( ETH_BUFFER_SIZE - Xtail ) / 4;
			
            dataWordLenght = ( BufLen + 3 ) / 4;                                        
            
            if( ( dataWordLenght + 2 ) <= EthTransmitterFreeBufferSize )
            {
                *ptr_OutputFrame++= BufLen;                                             // Write byte count
				
                memcpy( ptr_OutputFrame, ptr_OutputBuffer, dataWordLenght * 4 );
                ptr_OutputFrame += dataWordLenght;
                
                ptr_OutputFrame++;                                                      // Place for status word
			}
			else
            {
                if( EthTransmitterFreeBufferSize > 0 )
                {
                    *ptr_OutputFrame++= BufLen;                                         // Write byte count
                    EthTransmitterFreeBufferSize--;
                    
                    memcpy( ptr_OutputFrame, ptr_OutputBuffer, EthTransmitterFreeBufferSize );
                    ptr_OutputBuffer += EthTransmitterFreeBufferSize;
                    
                    ptr_OutputFrame = (uint32_t *)(ETH_BUFF_BASE_ADDR + MDR_ETH0->DILIMETR);
                    memcpy( ptr_OutputFrame, ptr_OutputBuffer, dataWordLenght - EthTransmitterFreeBufferSize );
                    ptr_OutputFrame += dataWordLenght - EthTransmitterFreeBufferSize;
                    
                    ptr_OutputFrame++;                                                  // Place for status word 
                }
                else
                {
                    ptr_OutputFrame = (uint32_t *)(ETH_BUFF_BASE_ADDR + MDR_ETH0->DILIMETR);
                    
                    *ptr_OutputFrame++= BufLen;                                         // Write byte count
                    
                    memcpy( ptr_OutputFrame, ptr_OutputBuffer, dataWordLenght - EthTransmitterFreeBufferSize );
                    ptr_OutputFrame += dataWordLenght;

                    ptr_OutputFrame++;                                                  // Place for status word
                }
			}
			
            Xtail = ((uint32_t)(ptr_OutputFrame) - ETH_BUFF_BASE_ADDR)&0xFFFC;
			
            if( Xtail >= ETH_BUFFER_SIZE )
				Xtail = MDR_ETH0->DILIMETR;
			
            /* Write the new value of the ETH_X_Tail register */
			MDR_ETH0->X_TAIL = Xtail;
			break;
		case ETH_BUFFER_MODE_AUTOMATIC_CHANGE_POINTERS:
			/* Set pointer to output buffer */
			ptr_OutputFrame = (uint32_t *)(ETH_BUFF_BASE_ADDR + Xtail);
			/* Send frame */
			EthTransmitterFreeBufferSize = (ETH_BUFFER_SIZE - Xtail) / 4;
			if(((BufLen +3)/4 + 2) < EthTransmitterFreeBufferSize){
				for( i = 0; i < (BufLen + 3)/4 + 2; i++ ){
					*ptr_OutputFrame++ = ptr_OutputBuffer[i];
				}
			}
			else{
				for( i = 0; i < EthTransmitterFreeBufferSize; i++ ){
					*ptr_OutputFrame++ = ptr_OutputBuffer[i];
				}
				tmp = i;
				ptr_OutputFrame = (uint32_t *)(ETH_BUFF_BASE_ADDR + MDR_ETH0->DILIMETR);
				for(i = 0; i < (((BufLen + 3)/4 + 2) - EthTransmitterFreeBufferSize); i++){
					*ptr_OutputFrame++ = ptr_OutputBuffer[i+tmp];
				}
			}
			break;
		case ETH_BUFFER_MODE_FIFO:
			/* Set the pointer to input frame */
			ptr_OutputFrame = (uint32_t *)(ETH_BUFF_BASE_ADDR + 4);
			/* Send frame */
//			ETH_DMAFrameTx(ptr_OutputFrame, ((BufLen+3)/4 + 2), ptr_OutputBuffer);
			break;
	}
}

/** @} */ /* End of group ETH_Private_Functions */

/** @} */ /* End of group ETHERNET */

/** @} */ /* End of group __MDR32F2C10_StdPeriph_Driver */

/******************* (C) COPYRIGHT 2021 Milandr *********************************
*
* END OF FILE MDR32F2C10_eth.c */

